# Shell & terminal
brew "bash"                    # Updated bash (macOS ships ancient 3.x)
brew "bat"                     # cat with syntax highlighting, line numbers, git diff
brew "btop"                    # Resource monitor (htop alternative)
brew "coreutils"               # GNU coreutils (gdate, greadlink, etc.)
brew "curl"                    # Updated curl with HTTP/3 support
brew "direnv"                  # Per-directory environment variables
brew "eza"                     # Modern ls replacement with icons/git
brew "fd"                      # find but faster and saner syntax
brew "fzf"                     # Fuzzy finder for shell
brew "htop"                    # Interactive process viewer
brew "pandoc"                  # Universal document converter (md → pdf/docx/html)
brew "starship"                # Cross-shell prompt
brew "telnet"                  # Removed from macOS, still useful for debugging
brew "tmux"                    # Terminal multiplexer
brew "tree"                    # Directory tree viewer
brew "zoxide"                  # Smart cd with frecency
brew "zsh-syntax-highlighting" # Fish-like syntax highlighting for zsh
brew "zsh-autosuggestions"     # Fish-like autosuggestions for zsh

# Dev tools
brew "biome"                   # JS/TS linter and formatter
brew "chezmoi"                 # Dotfile manager
brew "cloc"                    # Count lines of code
brew "gcc"                     # GNU compiler collection
brew "gh"                      # GitHub CLI
brew "git"                     # Version control
brew "git-lfs"                 # Git large file storage
brew "gnupg"                   # GPG for signing commits/encryption
brew "go"                      # Go programming language
brew "graphite2"               # Stacked PRs workflow (gt CLI)
brew "jq"                      # JSON processor (also used by sketchybar plugins)
tap "hedhyw/main"
brew "hedhyw/main/jlv"         # Interactive JSON log viewer
brew "lazygit"                 # Terminal UI for git
brew "node"                    # Node.js
brew "ripgrep"                 # Fast recursive search (rg)
brew "sqlite"                  # Embedded SQL database

# Infrastructure & services
brew "doppler"                 # Secrets manager CLI
brew "granted"                 # AWS role switching
brew "k9s"                     # Kubernetes TUI
brew "kubectx"                 # Switch kube contexts/namespaces
brew "kubernetes-cli"          # kubectl
brew "redis"                   # In-memory data store
brew "temporal"                # Workflow orchestration CLI

# Libraries & utilities
brew "ghostscript"             # PostScript/PDF interpreter (for tesseract)
brew "libpq"                   # PostgreSQL client library
brew "mas"                     # Mac App Store CLI
brew "ocrmypdf"                # Add OCR text layer to scanned PDFs
brew "python@3"                # Latest Python 3
brew "tesseract"               # OCR engine

# Window management
tap "nikitabobko/tap"
cask "nikitabobko/tap/aerospace" # AeroSpace tiling window manager
tap "FelixKratz/formulae"
brew "borders"                 # JankyBorders — window border highlights
brew "sketchybar"              # Highly customizable macOS status bar
brew "switchaudio-osx"         # Switch audio output source (sketchybar volume_click)
brew "nowplaying-cli"          # Now playing info (used by sketchybar)
brew "fswatch"                 # File change watcher via FSEvents (sketchybar keyboard layout)

# Casks - Apps
tap "updatest/tap", "https://github.com/updatest/tap.git"
cask "updatest/tap/updatest"   # Updatest — menu bar app updater

# AI & productivity
cask "chatgpt"                 # ChatGPT desktop app
cask "claude"                  # Claude AI desktop app
cask "cursor"                  # AI-powered code editor
cask "granola"                 # AI meeting notes
cask "obsidian"                # Knowledge base / second brain
cask "raycast"                 # Launcher & productivity tool
cask "wispr-flow"              # Voice-to-text

# Communication
cask "signal"                  # Encrypted messaging
cask "telegram"                # Messaging
cask "whatsapp"                # Messaging
cask "zoom"                    # Video conferencing

# Dev tools
cask "docker-desktop"          # Docker Desktop
cask "ghostty"                 # Ghostty terminal emulator
cask "github"                  # GitHub Desktop
cask "ngrok"                   # Secure tunnels to localhost
cask "visual-studio-code"      # VS Code editor

# Media & entertainment
cask "movist-pro"              # Media player
cask "spotify"                 # Music streaming

# macOS utilities
cask "1password"               # 1Password password manager
cask "1password-cli"           # 1Password CLI (op)
cask "adguard"                 # Ad blocker
cask "bartender"               # Menu bar organizer
cask "bettertouchtool"         # Trackpad gesture customizer (AeroSpace swipe)
cask "cleanshot"               # Screenshot & recording tool
cask "copilot-money"           # Personal finance
cask "daisydisk"               # Disk space analyzer
cask "google-chrome"           # Web browser
cask "google-drive"            # Cloud storage
cask "homerow"                 # Keyboard navigation for macOS
cask "karabiner-elements"      # Keyboard customizer
cask "keka"                    # File archiver
cask "notunes"                 # Prevent Apple Music from opening on media key
cask "cheatsheet"              # Hold ⌘ to see all shortcuts for current app
cask "screen-studio"           # Screen recording
cask "tailscale-app"           # Mesh VPN

# Hardware
cask "elgato-wave-link"        # Elgato audio mixer
cask "logi-options+"           # Logitech device config
cask "mac-mouse-fix"           # Mouse utility

# Mac App Store
mas "Things 3", id: 904280696
mas "Tot", id: 1491071483

# Casks - Fonts
cask "sf-symbols"              # SF Symbols app (used by sketchybar)
cask "font-cascadia-code"
cask "font-cascadia-code-nf"
cask "font-cascadia-code-pl"
cask "font-cascadia-mono"
cask "font-cascadia-mono-nf"
cask "font-cascadia-mono-pl"
cask "font-hack-nerd-font"
cask "font-hermit"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-mono"
cask "font-sf-mono-for-powerline"
cask "font-sf-mono-nerd-font-ligaturized"
cask "font-sf-pro"
cask "font-symbols-only-nerd-font"
