# Shell & terminal
brew "bash"                    # Updated bash (macOS ships ancient 3.x)
brew "btop"                    # Resource monitor (htop alternative)
brew "coreutils"               # GNU coreutils (gdate, greadlink, etc.)
brew "curl"                    # Updated curl with HTTP/3 support
brew "direnv"                  # Per-directory environment variables
brew "eza"                     # Modern ls replacement with icons/git
brew "fzf"                     # Fuzzy finder for shell
brew "starship"                # Cross-shell prompt
brew "telnet"                  # Removed from macOS, still useful for debugging
brew "tmux"                    # Terminal multiplexer
brew "tree"                    # Directory tree viewer
brew "zoxide"                  # Smart cd with frecency

# Dev tools
brew "biome"                   # JS/TS linter and formatter
brew "chezmoi"                 # Dotfile manager
brew "cloc"                    # Count lines of code
brew "gcc"                     # GNU compiler collection
brew "gh"                      # GitHub CLI
brew "git"                     # Version control
brew "git-lfs"                 # Git large file storage
brew "gnupg"                   # GPG for signing commits/encryption
brew "go"                      # Go programming language
brew "graphite2"               # Stacked PRs workflow (gt CLI)
brew "jq"                      # JSON processor
tap "hedhyw/main"
brew "hedhyw/main/jlv"         # Interactive JSON log viewer
brew "lazygit"                 # Terminal UI for git
brew "node"                    # Node.js
brew "ripgrep"                 # Fast recursive search (rg)
brew "sqlite"                  # Embedded SQL database

# Infrastructure & services
brew "doppler"                 # Secrets manager CLI
brew "granted"                 # AWS role switching
brew "k9s"                     # Kubernetes TUI
brew "kubectx"                 # Switch kube contexts/namespaces
brew "kubernetes-cli"          # kubectl
brew "redis"                   # In-memory data store
brew "temporal"                # Workflow orchestration CLI

# Libraries & utilities
brew "ghostscript"             # PostScript/PDF interpreter (for tesseract)
brew "libpq"                   # PostgreSQL client library
brew "mas"                     # Mac App Store CLI
brew "python@3"                # Latest Python 3
brew "tesseract"               # OCR engine

# Window management
tap "nikitabobko/tap"
cask "nikitabobko/tap/aerospace" # AeroSpace tiling window manager
tap "FelixKratz/formulae"
brew "borders"                 # JankyBorders — window border highlights

# Casks - Apps
cask "1password"               # 1Password password manager
cask "1password-cli"           # 1Password CLI (op)
cask "adguard"                 # Ad blocker
cask "bartender"               # Menu bar organizer
cask "chatgpt"                 # ChatGPT desktop app
cask "claude"                  # Claude AI desktop app
cask "cleanshot"               # Screenshot & recording tool
cask "visual-studio-code"      # VS Code editor
cask "docker-desktop"          # Docker Desktop
cask "ghostty"                 # Ghostty terminal emulator
cask "github"                  # GitHub Desktop
cask "google-chrome"           # Web browser
cask "homerow"                 # Keyboard navigation for macOS
cask "raycast"                 # Launcher & productivity tool

# Mac App Store
mas "Things 3", id: 904280696
mas "Tot", id: 1491071483

# Casks - Fonts
cask "font-cascadia-code"
cask "font-cascadia-code-nf"
cask "font-cascadia-code-pl"
cask "font-cascadia-mono"
cask "font-cascadia-mono-nf"
cask "font-cascadia-mono-pl"
cask "font-hermit"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-mono"
cask "font-sf-mono-for-powerline"
cask "font-sf-mono-nerd-font-ligaturized"
cask "font-sf-pro"
cask "font-symbols-only-nerd-font"
